# Union Government of India: Structure, Powers, and Functions — A Research Blueprint for a 200-Question Compendium

## Executive Summary and Objectives

This report provides a comprehensive research and writing blueprint to compile a 200-question compendium on the Union Government of India—its structure, powers, functions, and the inter-institutional checks and balances established by the Constitution. The target audience includes civil services aspirants, law students, political science researchers, and editorial teams preparing rigorous, exam-aligned question banks.

The Union executive comprises the President, the Vice-President, and the Council of Ministers with the Prime Minister at its head. Parliament consists of the President, the Lok Sabha (House of the People), and the Rajya Sabha (Council of States). The Supreme Court is the apex judicial authority with constitutional, original, appellate, advisory, and writ jurisdictions. Federal relations—legislative, administrative, and financial—are enumerated across Parts XI and XII. Emergency provisions (Part XVIII) enable temporary centralization during crises. Across these domains, constitutional articles anchor authority, while landmark cases, assembly resolutions, and Finance Commission recommendations shape practical application. The official profiles and constitutional texts frame the authoritative baseline.[^1][^5][^6]

Deliverables:
- A structured, quantified distribution of 200 questions across topics and cognitive levels.
- A verification framework mapping every question to specific constitutional provisions and credible sources.
- Thematic expositions for each institution and relation, with tables summarizing procedures, jurisdiction, and devolution.
- Editorial standards for consistency, accuracy, and exam relevance.

Narrative arc:
- What: Institutional architecture of the Union executive, Parliament, Supreme Court, federal relations, and emergency provisions.
- How: Procedural pathways (e.g., bills, impeachments), jurisdictional rules, appointment processes, and executive instruments (e.g., ordinances, pardons).
- So what: Checks and balances, federal dynamics, and emergency management—anchored in articles and amendments—tested via scenario-based questions grounded in authoritative sources.

## Methodology and Source Validation

The research approach triangulates the constitutional text, official parliamentary and government portals, credible explainers, and curated case summaries to ensure accuracy and exam relevance.

- Primary legal text: Part V (The Union), Part XI (Union–State Relations), Part XII (Finance, Property, Contracts and Suits), Part XVIII (Emergency Provisions), and the consolidated Constitution text provide the authoritative anchor for articles, procedures, and schedules.[^5][^7][^6][^10]
- Parliamentary procedures: Lok Sabha/Digital Sansad portals clarify bill types, introduction, passage, joint sittings, and presidential assent.[^15][^16][^17][^18]
- Institutional profiles: Government portals outline the Union executive, Parliament’s functions, and vice-presidential roles.[^1][^3][^2]
- Judiciary: Official judgment summaries, institutional explainers, and jurisdiction overviews define the Supreme Court’s role and key holdings.[^20][^21][^23][^25]
- Federal relations and emergencies: Official parts and credible analyses detail legislative lists, administrative directions, finance/devolution, emergency proclamations, and their judicial review.[^7][^8][^9][^11][^28][^29][^30]
- Amendments: Authoritative summaries and amendment lists contextualize structural shifts (e.g., 42nd, 44th, 73rd, 74th, 101st GST).[^31][^33][^32][^35]

Verification protocol:
- Map each question to at least one specific constitutional article; where procedures or jurisdiction are concerned, cross-check with official portals or credible explainers.
- Avoid unreferenced factual claims; use standardized article formatting (e.g., Article 72) across question stems and answer explanations.
- Cross-source any procedural detail (e.g., money bill certification under Article 109) with both Lok Sabha and Rajya Sabha materials.
- Triangulate emergency provisions and case impacts with MEA PDFs and judiciary summaries.

Inclusion criteria:
- Normative authority derived from constitutional articles.
- Procedural clarity drawn from official parliamentary documentation.
- Verified institutional roles and jurisdiction from government and judiciary portals.
- Landmark cases referenced only when supported by official summaries or reputable institutional explainers.

Scope limits and information gaps:
- Precise numerical vote-values for presidential elections and electoral college sizes fluctuate; formulas are authoritative, but live figures must be verified against the Election Commission of India.
- The Supreme Court’s pendency and strength vary by date; use official sources or institutional explainers as of the compilation date.
- Landmark case holdings are limited here to official summaries and institutional explainers; deeper doctrinal detail requires direct judgment reading.
- A full enumeration of Union, State, and Concurrent List entries is beyond the scope of this blueprint; reference only where necessary.
- Governor’s reservation power under Article 200 is noted but not elaborated here; use official constitutional texts for full scope.
- Inter-state council dynamics (Article 263) are referenced; detailed operational practices warrant additional primary sources.
- Committee jurisdictions and disqualification regimes under the Tenth Schedule require direct parliamentary rules and case references not included here.

## Constitutional Architecture of the Union Executive

The Union executive consists of the President, the Vice-President, and the Council of Ministers (headed by the Prime Minister). The President is the head of state and the constitutional locus of the Union’s executive power; the Vice-President serves as ex-officio Chairperson of the Rajya Sabha and acts as President during vacancies; the Council of Ministers aids and advises the President, with collective responsibility to the Lok Sabha.[^4][^3][^1][^2]

To orient the reader across functions and checks, the following matrix synthesizes roles and article anchors. As a study aid, it also helps question-writers align stems and explanations to precise provisions.

Table 1. Executive roles and checks matrix

| Office | Core Functions | Key Articles | Checks and Balances |
|---|---|---|---|
| President | Executive power of the Union; supreme command of defence; summon/prorogue Parliament; dissolve Lok Sabha; assent to bills; promulgate ordinances; consult Supreme Court; grant pardons | 52–53, 60, 72, 74, 86–87, 111, 123, 143 | Advice of Council of Ministers binding (Article 74); impeachment procedure (Article 61); oath duties (Article 60) |
| Vice-President | Ex-officio Chairperson of Rajya Sabha; act as President during vacancy or inability; does not hold office of profit | 63–65 | Removal by resolution in both Houses; ceases Chairman functions while acting as President; emoluments during acting role | 
| Prime Minister and Council of Ministers | Aid and advise the President; allocation of portfolios; collective responsibility to Lok Sabha; duty to communicate decisions and information | 74–75, 78 | Collective responsibility; No-confidence machinery; PM’s duty to inform the President (Article 78) |

The President

The President’s election, qualifications, and tenure are set out in Articles 54–62. Election is by an electoral college comprising elected members of both Houses of Parliament and the legislative assemblies of states (including NCT of Delhi and Puducherry), via proportional representation with single transferable vote (STV). The formula for vote values aims at uniformity and parity across states and between Houses.[^5][^36][^40] The President’s term is five years, with eligibility for re-election; resignation is addressed to the Vice-President. Impeachment for violation of the Constitution follows Article 61: a written notice signed by at least one-fourth of the members of the initiating House, a resolution passed by not less than two-thirds of its total membership, investigation by the other House, and an identical two-thirds majority for removal.[^5][^36]

The President’s powers span executive, legislative, judicial, financial, and emergency domains. Executive power is vested in the President (Article 53), exercised directly or through subordinate officers; the President holds supreme command of the defence forces, regulated by law.[^4] Legislative instruments include summoning, prorogation, addresses to Parliament, messages, and assent to bills (Articles 86–87, 111). The President promulgates ordinances when Parliament is not in session (Article 123), and may consult the Supreme Court under Article 143. Pardoning powers under Article 72 extend to court-martial sentences, offenses within Union executive power, and all death sentences, subject to statutory limits and Governor’s parallel powers for suspension/remission/commutation.[^5][^37]

Table 2. President’s powers and checks

| Domain | Powers | Articles | Limits/Checks |
|---|---|---|---|
| Executive | Vests in the President; exercised directly/through subordinates; supreme command of defence | 53 | Advice of Council of Ministers binding (Article 74); law regulates defence command |
| Legislative | Address/send messages; summon/prorogue; assent/withhold/return bills; special address | 86–87, 111 | Money Bills cannot be returned; joint sitting governed by Article 108 |
| Judicial | Pardons, commutations, respites, remissions; suspend/commute certain sentences; consult SC | 72, 143 | Court-martial powers limited by statute; Governor’s parallel powers; advisory under 143 |
| Financial | Assent to financial legislation; receives budget and accounts | 111 (Bills), Part XII (framework) | Parliament’s control via Money/Financial Bills |
| Emergency | Proclaim national/state emergencies; issue ordinances | 352–356, 123 | Judicial review; parliamentary control; amendment safeguards (e.g., 44th) |

The Vice-President

The Vice-President is elected by a joint electoral college of both Houses of Parliament via STV and proportional representation, serving a five-year term, and continues in office until a successor assumes charge.[^2][^39][^41] As ex-officio Chairperson of the Rajya Sabha (Article 64), the Vice-President presides over its sessions and interprets procedural matters within the Chair’s authority.[^27][^26] The Vice-President acts as President during a casual vacancy until a new President is elected (within six months), and discharges the President’s functions during absence, illness, or other inability (Article 65). During such acting tenure, the Vice-President does not perform Rajya Sabha Chair duties and is entitled to the President’s emoluments and privileges.[^2]

Table 3. Vice-President—roles, succession, and removal

| Dimension | Details | Articles/Procedure |
|---|---|---|
| Election | Electoral college of both Houses of Parliament; STV/proportional representation | Article 66; statutory framework per election law |
| Chair of Rajya Sabha | Ex-officio Chairperson; presides over sessions; interprets rules | Article 64; Rajya Sabha procedural documentation |
| Acting President | Vacancy or inability; functions until President resumes or new election (≤6 months) | Article 65 |
| Removal | Resolution by majority of Rajya Sabha members and agreement by Lok Sabha; minimum 14 days’ notice | Vice-presidency removal procedure per Constitution |

Prime Minister and Council of Ministers

The Prime Minister is appointed by the President; other ministers are appointed on the Prime Minister’s advice. The Council of Ministers is collectively responsible to the Lok Sabha (Article 75(3)), and it aids and advises the President (Article 74). The Prime Minister has a constitutional duty to communicate to the President all decisions of the Council relating to the administration of the Union and proposals for legislation, and to furnish such information as the President may call for (Article 78). Portfolios are allocated by the Prime Minister within the Council.[^3][^43][^45][^46][^1]

Table 4. Council of Ministers composition and responsibility

| Element | Description | Articles |
|---|---|---|
| Composition | Cabinet Ministers; Ministers of State (independent charge); Ministers of State; Deputy Ministers | 75 |
| Responsibility | Collective responsibility to Lok Sabha | 75(3) |
| Advice and information | Council aids and advises President; PM communicates decisions and information to President | 74, 78 |
| Tenure | Dependent on majority support in Lok Sabha; pm dismissal if lost; resignation upon loss of confidence | Parliamentary conventions |

## Parliament: Structure, Powers, and Legislative Procedure

Parliament comprises the President, the Lok Sabha, and the Rajya Sabha. The Lok Sabha is the House of the People, constituted by direct election on adult suffrage, with a maximum strength of 552 members (530 from states, 20 from UTs, up to 2 nominated Anglo-Indians if inadequately represented), and a term of five years unless dissolved earlier.[^3] Its present strength is 545 members, with seat allocation based on population and freeze provisions under the 84th Amendment until the first census after 2026.[^3] The Rajya Sabha has a maximum strength of 250 (233 from states and UTs; 12 nominated), is not subject to dissolution, and elects one-third of its members every second year.[^3]

Functions and powers include legislation; oversight of administration; financial control; impeachment of the President; removal of judges of the Supreme Court and High Courts, the Chief Election Commissioner, and the Comptroller and Auditor General; deliberation on national policies and international relations; and review of delegated legislation.[^3] Money Bills can only be introduced in the Lok Sabha; the Rajya Sabha may recommend changes but cannot amend or delay passage beyond 14 days.[^15][^17][^14]

Table 5. Lok Sabha vs Rajya Sabha—key features

| Feature | Lok Sabha | Rajya Sabha |
|---|---|---|
| Composition | Elected by people (adult suffrage) | Representatives of states and UTs; 12 nominated |
| Strength | Max 552; current 545 | Max 250; current 245 |
| Term/Dissolution | 5 years; subject to dissolution | Not dissolved; one-third retire every two years |
| Financial role | Exclusive introduction of Money Bills | Recommendations only; cannot amend Money Bills |
| Control over Executive | No-confidence; budget approvals | No confidence not applicable; oversight via debates/questions |

Legislative procedure is governed by Articles 107–111, with special provisions for Money Bills (Articles 109–110), and a joint sitting mechanism under Article 108 in defined circumstances. Presidential assent under Article 111 completes the enactment.[^16][^17][^18][^10]

Table 6. Bill types and passage

| Bill Type | Introduction | Rajya Sabha Role | Presidential Assent | Articles |
|---|---|---|---|---|
| Ordinary Bill | Either House | Amendments, debate | Assent/withhold/return | 107–111 |
| Money Bill | Lok Sabha only | Recommendations; return within 14 days; certificate final | Assent (Speaker’s certificate conclusive) | 109–110 |
| Financial Bill (non-Money) | Either House | Amendments, debate | Assent/withhold/return | 107–111 (interpretive) |
| Constitutional Amendment | Either House | Special majority; sometimes ratification | Assent | Article 368 procedure |

Joint Sitting

Under Article 108, a joint sitting can be convened when the Houses disagree on a bill (after passage in one and rejection or lack of consideration in the other), when they fail to reach agreement on amendments, or when more than six months elapse without second House consideration. The Speaker of the Lok Sabha presides, and passage requires a majority of members present and voting. Joint sittings do not apply to Money Bills, constitutional amendment bills, or bills seeking to amend State Lists.[^16][^18]

Table 7. Joint sitting—conditions and exceptions

| Condition | Presiding/Outcome | Exceptions |
|---|---|---|
| Rejection by one House after passage in the other; disagreement on amendments; >6 months’ delay | Speaker presides; majority of those present and voting; bill deemed passed by both Houses | Money Bills; Constitutional amendment Bills; State List amendments |

Lok Sabha (House of the People)

The Lok Sabha’s composition, distribution of seats across states and UTs, term, and extension mechanics are constitutional. Its financial supremacy derives from exclusive control over Money Bills and the appropriation process. Oversight tools include questions, debates, committees, and no-confidence motions, which hold the executive accountable and shape policy.[^3][^14]

Table 8. Lok Sabha—key features

| Element | Details |
|---|---|
| Strength and composition | Max 552; current 545; seat allocation uniform by population; 84th Amendment freeze on seats until first census after 2026 |
| Term and extension | 5 years; extendable during emergency by law, not exceeding one year at a time and six months after emergency ceases |
| Financial control | Exclusive initiation of Money Bills; appropriation from Consolidated Fund |

Rajya Sabha (Council of States)

The Rajya Sabha represents states and UTs, with indirect election via proportional representation and STV, and 12 nominated members from literature, science, art, and social service. It cannot be dissolved, and one-third of its members retire biennially. In legislation, it has limited powers over Money Bills but plays a crucial role in deliberation, amendments, and representing federal interests.[^3][^27]

Table 9. Rajya Sabha—key features

| Element | Details |
|---|---|
| Strength and composition | Max 250; elected representatives (≤238) + 12 nominated |
| Election and term | Indirect election via STV; one-third retire every two years; not subject to dissolution |
| Money Bill role | Recommendations only; 14-day return window; Speaker’s certificate final |

Legislative Procedure and Presidential Assent

Introduction, passage, and resolution of inter-House disagreements follow constitutional rules. Money Bills originate only in the Lok Sabha, with the Speaker’s certificate being final on the question of whether a bill is a Money Bill. The President may assent to, withhold assent from, or return a bill for reconsideration (except Money Bills). The Governor’s role in reserving certain state bills for the President’s consideration is recognized under state legislative frameworks but requires constitutional consultation for full scope.[^16][^18][^10]

Table 10. Article-wise legislative procedure matrix

| Article | Topic | Key Provisions |
|---|---|---|
| 107 | Introduction and passing of Bills | Bills may originate in either House (except Money Bills); both Houses must agree to final form; lapsing rules upon dissolution |
| 108 | Joint Sitting | Convened on disagreement or prolonged delay; Speaker presides; majority decision |
| 109 | Money Bills—special procedure | Lok Sabha initiation; Rajya Sabha recommendations only; Speaker’s certificate final |
| 110 | Definition of Money Bills | Taxation, borrowing, consolidated funds, appropriation, charged expenditures; incidental matters; exclusions (fees/fines) |
| 111 | Assent to Bills | President may assent/withhold/return (except Money Bills); Parliament may reconsider and repassing triggers assent |

## Supreme Court of India: Composition, Jurisdiction, and Key Cases

Establishment and composition

The Supreme Court of India, established in 1950, is the apex judicial body. Its strength is fixed at 34 judges (including the Chief Justice of India), appointed by the President after consultation as per constitutional norms and judicial conventions. Parliament may vary the number. Judges hold office until 65 years of age, with removal for misbehaviour or incapacity via parliamentary resolution under the Judges Enquiry Act framework. Salaries and allowances are charged on the Consolidated Fund of India and cannot be reduced to a judge’s disadvantage save during a financial emergency.[^21][^23]

Table 11. Supreme Court—composition and independence safeguards

| Dimension | Details | Articles/Framework |
|---|---|---|
| Strength | 34 judges (including CJI); Parliament may change number | Article 124 |
| Qualifications | HC judge (≥5 years) or advocate (≥10 years) or distinguished legal expert | Article 124(3) |
| Removal | Misbehaviour/incapacity; special majority in both Houses; removal order by President | Judges Enquiry Act; constitutional procedure |
| Salaries and allowances | Charged on Consolidated Fund; protected against disadvantageous changes | Article 124; financial emergency exceptions |
| Administrative mechanisms | Acting CJI (Article 126); ad hoc judges (Article 127); retired judges (Article 128) | Articles 126–128 |

Jurisdiction

- Original (Article 131): Exclusive original jurisdiction in disputes between the Government of India and one or more states, or between states, subject to exceptions relating to pre-constitutional treaties and agreements.
- Writ (Article 32): Power to issue directions, orders, or writs—habeas corpus, mandamus, prohibition, quo warranto, certiorari—for enforcing fundamental rights and constitutional legality.
- Appellate (Articles 132–136): Appeals from High Courts on substantial constitutional and legal questions; criminal appeals including death sentences; special leave to appeal (Article 136) in any court/tribunal subject to exclusion (e.g., armed forces tribunals).
- Advisory (Article 143): President may refer questions of law or fact of public importance, and pre-constitutional agreements, for advisory opinion.
- Court of Record (Article 129): Power to punish contempt; judgments recorded for legal precedent.[^21][^23][^24][^25]

Table 12. Jurisdiction summary

| Jurisdiction | Articles | Scope | Notable Caveats |
|---|---|---|---|
| Original | 131 | Inter-governmental disputes (Centre–state, state–state) | Excludes pre-constitutional treaties/agreements |
| Writ | 32 | Enforce Fundamental Rights and constitutional legality | Habeas corpus, mandamus, prohibition, quo warranto, certiorari |
| Appellate | 132–136 | Constitutional/legal appeals; death sentence cases; special leave | Article 136 discretionary; armed forces tribunals excluded |
| Advisory | 143 | Advisory opinions on public importance and pre-constitutional agreements | Advisory, not binding as a rule |
| Court of Record | 129 | Contempt powers; record of judgments | Punishable contempt |

Landmark judgments

The Supreme Court’s official summaries and institutional explainers identify several anchor cases—e.g., the Second Judges Case (1993), Third Judges Case (1998), and the 2015 judgment striking down the National Judicial Appointments Commission (NJAC) Act—each reshaping appointments and judicial independence. Broader case-law under writ jurisdiction (Article 32) and advisory references (Article 143) illustrate the Court’s role in constitutional enforcement and governance.[^20][^21][^23][^25]

Table 13. Landmark cases—thematic mapping

| Theme | Case/Issue | Principle/Outcome | Year | Article(s) |
|---|---|---|---|---|
| Judicial appointments | Second Judges Case | Chief Justice’s advice binding on the President | 1993 | 124; appointment conventions |
| Collegium | Third Judges Case | CJI must consult four senior judges; collegium refined | 1998 | 124; appointment conventions |
| Judicial independence | NJAC struck down | NJAC Act 2014 unconstitutional; independence preserved | 2015 | Basic structure doctrine |
| Fundamental rights | Article 32 enforcement | Court’s power to enforce FRs via writs | Historical | 32 |
| Advisory reference | Article 143 matters | Advisory opinions on public importance | Historical | 143 |

Recent Constitution Bench decisions (2024) inform procedural and doctrinal developments, with implications for constitutional litigation, separation of powers, and legislative challenges; a targeted review of the Court’s 2024 Constitution Bench outcomes should be undertaken before drafting advanced scenario questions.[^22]

## Union–State Relations: Legislative, Administrative, Financial

Legislative relations (Articles 245–255)

Parliament may legislate for the whole or any part of the territory of India; state legislatures may enact laws for the whole or any part of the state. The Constitution assigns legislative subjects through three Lists—Union, State, and Concurrent—with residuary powers vesting in Parliament (Article 248). Exceptions enable Parliament to legislate on State List subjects under specific conditions: Rajya Sabha resolution (Article 249), national emergency (Article 250), state requests for union legislation (Article 252), and implementation of international treaties (Article 253). President’s Rule (Article 356) entails parliamentary lawmaking over state subjects.[^7][^8][^11][^9]

Table 14. Legislative subject distribution and exceptions

| List | Authority | Exception Mechanism | Article |
|---|---|---|---|
| Union List | Parliament exclusive | — | Seventh Schedule; 248 |
| State List | State legislature exclusive | 249 (Rajya Sabha resolution); 250 (national emergency); 252 (state request); 253 (treaties); 356 (President’s Rule) | 249–253; 356 |
| Concurrent List | Both Parliament and states | — | Seventh Schedule; general conflict rules |

Administrative relations (Articles 256–263)

Executive power is distributed in line with legislative competence. States must exercise executive power in conformity with Parliament’s laws; the Centre can issue directions to states to ensure compliance and to protect states against external aggression and internal disturbance (Article 255, 355). Integrated judicial administration and all-India services provide structural cohesion in federal execution.[^8][^9]

Table 15. Administrative directions and sanctions

| Article | Direction | Coercive Sanction/Implication |
|---|---|---|
| 256 | Ensure compliance with Union laws | Directions backed by constitutional authority; non-compliance attracts coercion |
| 257 | Control of the Union over states in certain cases | Directions on communications, railways, linguistic minority education, ST welfare |
| 355 | Duty of Union to protect states | Central intervention duty in external/internal threats |
| 263 | Inter-state council | Coordination among states and Centre on specified subjects |

Financial relations (Articles 268–293; Finance Commission, Article 280)

Taxing powers and revenue distribution are structured to sustain federal finance. Taxes levied by the Centre but collected and used by states (Article 268); levied and collected by Centre but assigned to states (Article 269); and levied and collected by Centre but shared with states (Article 270) articulate devolution pathways. Statutory grants (Article 275) and discretionary grants (Article 282) provide non-tax transfers. The Finance Commission recommends vertical and horizontal shares; GST (Constitution One Hundred and First Amendment Act, 2016) transformed indirect taxation, creating a dual levy structure under Goods and Services Tax Council mechanisms.[^9][^11]

Table 16. Centre–State financial devolution

| Article | Mechanism | Example | Implication |
|---|---|---|---|
| 268 | Levied by Centre; collected and used by states | Stamp duties | State revenue certainty |
| 269 | Levied and collected by Centre; assigned to states | Taxes on sale/purchase of goods | State share on specific taxes |
| 270 | Levied and collected by Centre; distributed between Centre and states | Income tax (excluding surcharges/cess) | Vertical/horizontal devolution |
| 275 | Statutory grants | Grants determined by Finance Commission | Conditional/non-conditional support |
| 282 | Discretionary grants | Centre/states grants for public purpose | Flexible spending |

Table 17. Finance Commission—scope

| Dimension | Description | Article |
|---|---|---|
| Function | Recommend sharing of taxes and grants-in-aid | 280 |
| Scope | Vertical/horizontal splits; criteria; state support | 280 |
| Interaction | GST framework requires coordination with Finance Commission | 101st Amendment; 280 |

## Emergency Provisions: Articles 352, 356, 359 (and 360)

Part XVIII outlines emergency tools that enable the Union to respond to extraordinary situations. The 44th Amendment introduced safeguards (e.g., replacing “internal disturbance” with “armed rebellion” for national emergency, and requiring written Cabinet advice for the President’s proclamation). These provisions temporarily centralize power and modify federal dynamics.[^6][^28][^29][^30][^31]

Table 18. Emergency comparison

| Type | Trigger | Effect on Federal Structure | Parliamentary Control | Judicial Review | Key Articles |
|---|---|---|---|---|---|
| National Emergency (352) | War, external aggression, armed rebellion | Centre directs state executive power; unified command | President's proclamation must be approved by Parliament | Subject to judicial review; rights protections (44th Amendment) | 352–355 |
| President’s Rule (356) | Failure of constitutional machinery in a state | Union assumes state functions; legislative power shifts to Parliament | Approval by Parliament; resolution/periodic review | Judicial review for misuse/arbitrariness | 356–357 |
| Financial Emergency (360) | Threat to financial stability/credit of India | Centre may issue directions to states; financial controls | President’s proclamation laid before Parliament | Judicial review of proportionality and process | 360 |

National Emergency (Article 352)

The President may proclaim a national emergency when security is threatened by war, external aggression, or armed rebellion. The 44th Amendment requires written Cabinet advice and replaced “internal disturbance” with “armed rebellion,” tightening triggers. During emergency, the Centre may direct states on executive power; rights may be suspended under Article 359 within defined limits, subject to judicial scrutiny and textual constraints (e.g., non-suspension of certain fundamental rights under the 44th Amendment).[^29][^31][^6]

President’s Rule (Article 356)

If the President is satisfied that a state has failed to maintain constitutional machinery, President’s Rule may be imposed. Legislative powers of the state are exercised by Parliament; the Governor acts on the President’s aid and advice. Judicial review checks misuse, requiring satisfaction grounded in material and proportionality; historical cases have shaped standards for intervention.[^28][^30]

Financial Emergency (Article 360)

If the President is satisfied that the financial stability or credit of India is threatened, a Financial Emergency may be proclaimed. The Centre can issue directions to states for financial prudence, and the proclamation is subject to parliamentary control. While rare, such emergencies would amplify central oversight of state budgets and expenditures.[^28][^6]

## Key Constitutional Amendments Affecting the Union

Major amendments reshaped Union powers, checks and balances, and federal structure.

Table 19. Amendments—summary of changes and Union impact

| Amendment | Year | Key Changes | Union Government Impact |
|---|---|---|---|
| 42nd | 1976 | Preamble words (socialist, secular, integrity); Fundamental Duties; Article 74 advice made binding; Tribunals; seat freeze; extended Lok Sabha tenure; curtailed judicial review scope | Strengthened Union executive and Parliament; centralized control; expanded Centre’s reach |
| 44th | 1978 | Restored judicial powers; “armed rebellion”; Cabinet written advice; FR protections (Articles 20–21 not suspendable); property right reclassification | Reestablished checks and balances; limited emergency triggers |
| 73rd | 1992 | Panchayati Raj in Eleventh Schedule; three-tier rural local government; reservations | Institutionalized third tier; required Union to support local bodies |
| 74th | 1992 | Municipalities in Twelfth Schedule; urban local bodies | Consolidated three-tier governance; urban policy and funding implications |
| 101st (GST) | 2016 | Dual GST structure; GST Council | Transformed indirect taxation; Centre–State coordination intensified |

These amendments illustrate the evolving constitutional balance between Union strength and federal autonomy, and between executive authority and judicial review.[^33][^32][^35][^31]

## Design of the 200-Question Compendium: Taxonomy and Coverage

To ensure comprehensive coverage and exam relevance, the compendium is structured across eight themes with a balanced cognitive distribution.

Table 20. Question distribution plan

| Topic | Target Count | Article Anchors | Sub-themes |
|---|---|---|---|
| President | 20 | 52–62, 72, 74, 86–87, 111, 123, 143 | Election, qualifications, term; impeachment; pardons; legislative role; emergency; ordinances; advisory |
| Vice-President | 15 | 63–67 | Election; Chairman role; acting President; removal |
| Prime Minister & Council of Ministers | 25 | 74–75, 78 | Composition; appointment; collective responsibility; advice/information |
| Parliament—Structure & Functions | 25 | Part V Chapter II | Lok Sabha composition; Rajya Sabha representation; oversight; privileges |
| Legislative Procedure | 20 | 107–111, 108 | Bill types; Money Bills; joint sitting; assent; certificate |
| Supreme Court | 30 | 124–147 | Composition; appointments; jurisdictions; writs; advisory; contempt; cases |
| Union–State Relations | 35 | Part XI, Part XII; 249–253; 256–263; 268–293; 280 | Lists; exceptions; administrative directions; grants; Finance Commission; GST |
| Emergency Provisions | 20 | 352–360 | National Emergency; President’s Rule; Financial Emergency; rights suspension; safeguards |
| Constitutional Amendments & Articles | 10 | 368; amendments (42nd, 44th, 73rd, 74th, 101st) | Basic structure; amendment procedure; significant shifts |

Table 21. Cognitive level mapping

| Cognitive Level | Proportion | Count | Assessment Modes |
|---|---|---|---|
| Knowledge | 40% | 80 | Direct recall of articles, definitions, institutional roles |
| Comprehension | 35% | 70 | Explain procedures, jurisdiction, and principles |
| Application | 20% | 40 | Scenario-based: ordinance promulgation, emergency proclamation, pardons |
| Analysis | 5% | 10 | Compare joint sitting vs bicameral dynamics; examine amendment impacts |

Question drafting templates and stems:
- Direct provision: “Under Article [X], state the President’s power to [function] and explain any limitations.”
- Procedural: “Outline the steps under Articles 107–111 for enactment of [Bill type], highlighting Rajya Sabha’s role.”
- Case-application: “Apply Article 32 to a scenario involving [right infringement], identifying the appropriate writ and relief.”
- Comparative: “Contrast Article 352 and 356 emergencies in terms of triggers, effects on federalism, and parliamentary control.”
- Amendment linkage: “Explain how the 44th Amendment altered emergency triggers and Fundamental Rights protections.”

Answer key schema:
- Primary citation (article/Schedule), secondary source (official portal/credible explainer), and short rationale explaining the constitutional basis and procedural steps.

## Practical Applications and Scenario Design

To translate constitutional doctrine into applied reasoning, scenarios must engage students in decision paths, checks, and consequences—anchored in articles and credible procedures.

Illustrative scenarios:

- Ordinance promulgation (Article 123): The President promulgates an ordinance during parliamentary recess. Students must identify conditions (recess of both Houses), subject matter constraints (legislative domain), duration, and parliamentary review upon reassembly, including scenarios of repromulgation pitfalls.[^10][^18]
- National Emergency proclamation (Article 352): A government proposes a proclamation due to armed rebellion; students assess Cabinet advice requirements, parliamentary approval, and rights suspension scope under Article 359 and the 44th Amendment’s protections.[^6][^29][^31]
- President’s Rule in a state (Article 356): Analyze material failure of constitutional machinery, judicial review standards, and legislative substitution under Article 357; evaluate misuse allegations and remedial pathways.[^28][^30]
- Money Bill certification (Article 110, 109): Examine classification disputes and the Speaker’s certificate’s finality; consider Rajya Sabha’s recommendation-only role and time-bound return window.[^15][^17][^14]
- Supreme Court advisory (Article 143): Assess conditions for a presidential reference and the advisory opinion’s scope versus binding precedent; craft hypothetical advisory questions on federal disputes or constitutional interpretation.[^21][^10]

Checks and balances:

- Parliament vs executive: No-confidence mechanisms; budget control; oversight committees; questions and debates.
- Judiciary vs legislature: Judicial review of statutes; advisory references; contempt powers.
- Federal tensions: Centre’s directions to states; inter-state council; Finance Commission awards; GST Council decisions.
- Emergency constraints: Parliamentary approval; time limits; judicial review; textual rights protections.

Table 22. Scenario-to-article mapping

| Scenario | Articles | Decision Path | Checks and Balances |
|---|---|---|---|
| Ordinance promulgation | 123 | Recess → promulgate → present to Parliament → lapse/replace/enact | Parliamentary review; judicial review of excessive/repromulgation |
| National Emergency | 352–355; 359 | Cabinet advice → proclamation → parliamentary approval → periodic review | Judicial review; FR safeguards (44th Amendment) |
| President’s Rule | 356–357 | Satisfaction of failure → proclamation → parliamentary approval → legislative substitution | Judicial review; state assembly revival |
| Money Bill dispute | 109–110 | Introduction (LS) → RS recommendations → Speaker’s certificate → assent | RS time limit; Speaker’s finality |
| Advisory reference | 143 | Presidential reference → SC opinion | Advisory non-binding; informs future litigation |

These scenarios cultivate applied comprehension of the constitutional framework and institutional interactions, aligning with exam patterns that test both textual knowledge and practical reasoning.

## Source Mapping and Citation Plan

Each question will include:
- Primary legal citation: specific article(s).
- Secondary source(s): official portals (Know India, Digital Sansad), government PDFs (MEA), judiciary summaries, and credible institutional explainers.

Citation style:
- In-text article references (e.g., Article 72) with footnotes mapped to authoritative sources.
- For procedures, cite both constitutional text and official parliamentary documentation.
- For judicial holdings, rely on official summaries and institutional explainers for core principles.

Editorial policy:
- Verify article numbers and phrasing against official texts.
- Use consistent terminology (e.g., “Money Bill” vs “Financial Bill”).
- Annotate amendment impacts where relevant (e.g., 42nd, 44th, 73rd, 74th, 101st).
- Avoid unreferenced claims; where numbers vary (e.g., pendency, seat strength), note verification requirements.

Table 23. Coverage-to-source matrix (illustrative)

| Question Type | Article(s) | Primary Source | Secondary Source |
|---|---|---|---|
| Pardoning powers | 72 | Constitution (Part V) | Credible explainer |
| Money Bill passage | 109–110 | Lok Sabha/Digital Sansad | Rajya Sabha procedural note |
| Emergency trigger | 352 | MEA Part XVIII | Credible explainer |
| Supreme Court writs | 32 | Constitution (Part V) | Institutional explainer |
| Finance Commission | 280 | Constitution (Part XII) | EAC-PM |

## Editorial Standards and Quality Assurance

Consistency:
- Standardize article numbering, spelling, and nomenclature (e.g., “Lok Sabha”, “Rajya Sabha”, “Council of Ministers”).
- Use uniform templates for question stems, answer explanations, and source annotations.

Legal accuracy:
- Cross-check each question against primary constitutional texts and official portals.
- Triangulate procedural rules (e.g., joint sitting) with parliamentary documentation.
- For case references, rely on official summaries and institutional explainers; avoid disputed characterizations.

Coverage completeness:
- Ensure balanced representation across topics and cognitive levels.
- Include scenario-based questions that require multi-step reasoning and article linkage.

Quality assurance steps:
- Three-pass review: legal accuracy, procedural clarity, and pedagogy alignment.
- Final audit checklist confirming article mapping, source integrity, and ambiguity reduction.

Table 24. QA checklist

| Criterion | Checkpoint |
|---|---|
| Article accuracy | All article references verified against official texts |
| Procedural correctness | Bills, emergencies, impeachment—steps and exceptions aligned |
| Source integrity | Each answer cites at least one primary and one secondary source |
| Pedagogical clarity | Questions avoid ambiguity; stems match cognitive level |
| Balance and completeness | Topic coverage and difficulty distribution meet plan |
| Amendment linkage | Significant amendments integrated where relevant |
| Case referencing | Only official summaries or credible explainers used; holdings precisely stated |

## Conclusion

This blueprint equips editors and researchers to compile a rigorous 200-question compendium on the Union Government of India. It provides a structured architecture of the executive, Parliament, Supreme Court, federal relations, and emergency provisions, with procedural tables, jurisdiction matrices, and finance devolution summaries. The question design schema ensures balanced coverage and depth, while editorial and QA standards maintain accuracy and pedagogical clarity. By anchoring every question in constitutional articles and credible sources, the compendium will support advanced exam preparation and applied constitutional reasoning.

## References

[^1]: Know India: Profile - The Union - Executive. https://knowindia.india.gov.in/profile/the-union/executive.php  
[^2]: Vice President of India: VPI & Constitution. https://vicepresidentofindia.nic.in/vice-president-india-and-constitution  
[^3]: Know India: Profile - The Union - Legislature. https://knowindia.india.gov.in/profile/the-union/legislature.php  
[^4]: Constitution of India .net: Article 53 - Executive Power of the Union. https://www.constitutionofindia.net/articles/article-53-executive-power-of-the-union/  
[^5]: Constitution of India .net: Part V - The Union (Articles 52–151). https://www.constitutionofindia.net/parts/part-v/  
[^6]: MEA: Part XVIII - Emergency Provisions (Articles 352–360). https://www.mea.gov.in/Images/pdf1/Part18.pdf  
[^7]: MEA: Part XI - Relations between the Union and the States (Articles 245–263). https://www.mea.gov.in/Images/pdf1/Part11.pdf  
[^8]: Drishti Judiciary: Centre–State Relations in India. https://www.drishtijudiciary.com/to-the-point/ttp-constitution-of-india/centre-state-relations  
[^9]: Vajiram & Ravi: Centre–State Relations (UPSC Notes). https://vajiramandravi.com/upsc-exam/centre-state-relations/  
[^10]: Constitution Project: India 2016 (Consolidated Constitution Text). https://www.constituteproject.org/constitution/India_2016  
[^11]: EAC-PM: Enumeration of Legislative Powers in India. https://eacpm.gov.in/wp-content/uploads/2023/03/Enumeration-of-Legislative-Powers-in-India-1.pdf  
[^12]: Wikipedia: Parliament of India. https://en.wikipedia.org/wiki/Parliament_of_India  
[^13]: NEXT IAS: Roles, Powers and Functions of Parliament. https://www.nextias.com/blog/roles-powers-and-functions-of-parliament/  
[^14]: Digital Sansad: Introduction to Legislation (Parliamentary Process). https://sansad.in/ls/legislation/introduction  
[^15]: Rajya Sabha: Legislative Functions (Introduction to Bills & Procedures). https://cms.rajyasabha.nic.in/UploadedFiles/Legislation/Introduction.pdf  
[^16]: Drishti Judiciary: Legislative Procedure for Passing of Bills in Parliament (Articles 107–111). https://www.drishtijudiciary.com/ttp-constitution-of-india/legislative-procedure-for-passing-of-bills-in-parliament  
[^17]: Rajya Sabha: Legislative Procedure in the Rajya Sabha. https://cms.rajyasabha.nic.in/UploadedFiles/Procedure/PracticeAndProcedure/English/6/legislative_procedure.pdf  
[^18]: iPleaders: The Union Executive (Articles 52–78 and 123). https://blog.ipleaders.in/union-executive/  
[^19]: NEXT IAS: Powers and Functions of President of India. https://www.nextias.com/blog/powers-and-functions-of-president-of-india/  
[^20]: Supreme Court of India: Landmark Judgment Summaries. https://www.sci.gov.in/landmark-judgment-summaries/  
[^21]: Vajiram & Ravi: Supreme Court of India (UPSC Notes). https://vajiramandravi.com/upsc-exam/supreme-court-of-india/  
[^22]: Supreme Court Observer: Supreme Court Review 2024 — Constitution Bench Decisions. https://www.scobserver.in/journal/supreme-court-review-2024-constitution-bench-decisions/  
[^23]: iPleaders Blog: Jurisdiction of the Supreme Court. https://blog.ipleaders.in/jurisdiction-of-supreme-court/  
[^24]: LawTeacher: The Jurisdiction of the Supreme Court (Essay). https://www.lawteacher.net/free-law-essays/constitutional-law/the-jurisdiction-of-the-supreme-court-constitutional-law-essay.php  
[^25]: PRS India: Money Bills vs Other Bills. https://prsindia.org/theprsblog/money-bills-vs-other-bills?page=51&per-page=1  
[^26]: Parliament of India: Vice President as Chairman of Rajya Sabha (Ex-officio position). https://sansad.in/uploads/postion_Role_5_179a15f94b.pdf?updated_at=2022-11-28T09%3A50%3A12.019Z  
[^27]: Rajya Sabha (Wikipedia). https://en.wikipedia.org/wiki/Rajya_Sabha  
[^28]: NEXT IAS: Emergency Provisions (Articles 352–360). https://www.nextias.com/blog/emergency-provisions/  
[^29]: PMF IAS: National Emergency (Article 352). https://www.pmfias.com/national-emergency/  
[^30]: Wikipedia: States of Emergency in India. https://en.wikipedia.org/wiki/States_of_emergency_in_India  
[^31]: Vajiram & Ravi: Important Constitutional Amendments in India. https://vajiramandravi.com/current-affairs/constitutional-amendments-in-india/  
[^32]: BYJU’S: Constitution (42nd Amendment) Act, 1976. https://byjus.com/free-ias-prep/42nd-amendment-act/  
[^33]: Wikipedia: List of Amendments of the Constitution of India. https://en.wikipedia.org/wiki/List_of_amendments_of_the_Constitution_of_India  
[^34]: NEXT IAS: Amendment of the Constitution (Article 368). https://www.nextias.com/blog/amendment-of-the-constitution/  
[^35]: Drishti IAS: In-Depth — Major Constitutional Amendments. https://www.drishtiias.com/loksabha-rajyasabha-discussions/in-depth-major-constitutional-amendments  
[^36]: Clear IAS: The President of India (Articles 52–62). https://www.clearias.com/president-of-india/  
[^37]: NEXT IAS: Powers and Functions of President of India. https://www.nextias.com/blog/powers-and-functions-of-president-of-india/  
[^38]: Wikipedia: President of India. https://en.wikipedia.org/wiki/President_of_India  
[^39]: Wikipedia: Vice President of India. https://en.wikipedia.org/wiki/Vice_President_of_India  
[^40]: Constitution of India .net: Article 107 — Provisions as to Introduction and Passing of Bills. https://www.constitutionofindia.net/articles/article-107-provisions-as-to-introduction-and-passing-of-bills/  
[^41]: Drishti Judiciary: President of India (Article 52 to 62). https://www.drishtijudiciary.com/to-the-point/ttp-constitution-of-india/president